rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K39_TCD_0.h
#define TCD_0_CH6_INT_INT_MASK                   (0x1U)
#define TCD_0_CH6_INT_INT_SHIFT                  (0U)
#define TCD_0_CH6_INT_INT_WIDTH                  (1U)
#define TCD_0_CH6_INT_INT(x)                     (((uint32_t)(((uint32_t)(x)) << TCD_0_CH6_INT_INT_SHIFT)) & TCD_0_CH6_INT_INT_MASK)
/*! @} */

/*! @name CH6_SBR - Channel System Bus */
/*! @{ */

#define TCD_0_CH6_SBR_MID_MASK                   (0xFU)
#define TCD_0_CH6_SBR_MID_SHIFT                  (0U)
#define TCD_0_CH6_SBR_MID_WIDTH                  (4U)
#define TCD_0_CH6_SBR_MID(x)                     (((uint32_t)(((uint32_t)(x)) << TCD_0_CH6_SBR_MID_SHIFT)) & TCD_0_CH6_SBR_MID_MASK)

#define TCD_0_CH6_SBR_PAL_MASK                   (0x8000U)
#define TCD_0_CH6_SBR_PAL_SHIFT                  (15U)
#define TCD_0_CH6_SBR_PAL_WIDTH                  (1U)
#define TCD_0_CH6_SBR_PAL(x)                     (((uint32_t)(((uint32_t)(x)) << TCD_0_CH6_SBR_PAL_SHIFT)) & TCD_0_CH6_SBR_PAL_MASK)

#define TCD_0_CH6_SBR_EMI_MASK                   (0x10000U)
#define TCD_0_CH6_SBR_EMI_SHIFT                  (16U)
#define TCD_0_CH6_SBR_EMI_WIDTH                  (1U)
#define TCD_0_CH6_SBR_EMI(x)                     (((uint32_t)(((uint32_t)(x)) << TCD_0_CH6_SBR_EMI_SHIFT)) & TCD_0_CH6_SBR_EMI_MASK)

#define TCD_0_CH6_SBR_ATTR_MASK                  (0xE0000U)
#define TCD_0_CH6_SBR_ATTR_SHIFT                 (17U)
#define TCD_0_CH6_SBR_ATTR_WIDTH                 (3U)
#define TCD_0_CH6_SBR_ATTR(x)                    (((uint32_t)(((uint32_t)(x)) << TCD_0_CH6_SBR_ATTR_SHIFT)) & TCD_0_CH6_SBR_ATTR_MASK)
/*! @} */

/*! @name CH6_PRI - Channel Priority */
/*! @{ */

#define TCD_0_CH6_PRI_APL_MASK                   (0x7U)
#define TCD_0_CH6_PRI_APL_SHIFT                  (0U)
#define TCD_0_CH6_PRI_APL_WIDTH                  (3U)
#define TCD_0_CH6_PRI_APL(x)                     (((uint32_t)(((uint32_t)(x)) << TCD_0_CH6_PRI_APL_SHIFT)) & TCD_0_CH6_PRI_APL_MASK)

#define TCD_0_CH6_PRI_DPA_MASK                   (0x40000000U)
#define TCD_0_CH6_PRI_DPA_SHIFT                  (30U)
#define TCD_0_CH6_PRI_DPA_WIDTH                  (1U)
#define TCD_0_CH6_PRI_DPA(x)                     (((uint32_t)(((uint32_t)(x)) << TCD_0_CH6_PRI_DPA_SHIFT)) & TCD_0_CH6_PRI_DPA_MASK)

#define TCD_0_CH6_PRI_ECP_MASK                   (0x80000000U)
#define TCD_0_CH6_PRI_ECP_SHIFT                  (31U)
#define TCD_0_CH6_PRI_ECP_WIDTH                  (1U)
#define TCD_0_CH6_PRI_ECP(x)                     (((uint32_t)(((uint32_t)(x)) << TCD_0_CH6_PRI_ECP_SHIFT)) & TCD_0_CH6_PRI_ECP_MASK)
/*! @} */

/*! @name TCD6_SADDR - TCD Source Address */
/*! @{ */

#define TCD_0_TCD6_SADDR_SADDR_MASK              (0xFFFFFFFFU)
#define TCD_0_TCD6_SADDR_SADDR_SHIFT             (0U)
#define TCD_0_TCD6_SADDR_SADDR_WIDTH             (32U)
#define TCD_0_TCD6_SADDR_SADDR(x)                (((uint32_t)(((uint32_t)(x)) << TCD_0_TCD6_SADDR_SADDR_SHIFT)) & TCD_0_TCD6_SADDR_SADDR_MASK)
/*! @} */

/*! @name TCD6_SOFF - TCD Signed Source Address Offset */
/*! @{ */

#define TCD_0_TCD6_SOFF_SOFF_MASK                (0xFFFFU)
#define TCD_0_TCD6_SOFF_SOFF_SHIFT               (0U)
#define TCD_0_TCD6_SOFF_SOFF_WIDTH               (16U)
#define TCD_0_TCD6_SOFF_SOFF(x)                  (((uint16_t)(((uint16_t)(x)) << TCD_0_TCD6_SOFF_SOFF_SHIFT)) & TCD_0_TCD6_SOFF_SOFF_MASK)
/*! @} */

/*! @name TCD6_ATTR - TCD Transfer Attributes */
/*! @{ */

#define TCD_0_TCD6_ATTR_DSIZE_MASK               (0x7U)
#define TCD_0_TCD6_ATTR_DSIZE_SHIFT              (0U)
#define TCD_0_TCD6_ATTR_DSIZE_WIDTH              (3U)
#define TCD_0_TCD6_ATTR_DSIZE(x)                 (((uint16_t)(((uint16_t)(x)) << TCD_0_TCD6_ATTR_DSIZE_SHIFT)) & TCD_0_TCD6_ATTR_DSIZE_MASK)

#define TCD_0_TCD6_ATTR_DMOD_MASK                (0xF8U)
#define TCD_0_TCD6_ATTR_DMOD_SHIFT               (3U)
#define TCD_0_TCD6_ATTR_DMOD_WIDTH               (5U)
#define TCD_0_TCD6_ATTR_DMOD(x)                  (((uint16_t)(((uint16_t)(x)) << TCD_0_TCD6_ATTR_DMOD_SHIFT)) & TCD_0_TCD6_ATTR_DMOD_MASK)

#define TCD_0_TCD6_ATTR_SSIZE_MASK               (0x700U)
#define TCD_0_TCD6_ATTR_SSIZE_SHIFT              (8U)
#define TCD_0_TCD6_ATTR_SSIZE_WIDTH              (3U)
#define TCD_0_TCD6_ATTR_SSIZE(x)                 (((uint16_t)(((uint16_t)(x)) << TCD_0_TCD6_ATTR_SSIZE_SHIFT)) & TCD_0_TCD6_ATTR_SSIZE_MASK)

#define TCD_0_TCD6_ATTR_SMOD_MASK                (0xF800U)
#define TCD_0_TCD6_ATTR_SMOD_SHIFT               (11U)
#define TCD_0_TCD6_ATTR_SMOD_WIDTH               (5U)
#define TCD_0_TCD6_ATTR_SMOD(x)                  (((uint16_t)(((uint16_t)(x)) << TCD_0_TCD6_ATTR_SMOD_SHIFT)) & TCD_0_TCD6_ATTR_SMOD_MASK)
/*! @} */

/*! @name TCD6_NBYTES_MLOFFNO - TCD Transfer Size Without Minor Loop Offsets */
/*! @{ */

#define TCD_0_TCD6_NBYTES_MLOFFNO_NBYTES_MASK    (0x3FFFFFFFU)
#define TCD_0_TCD6_NBYTES_MLOFFNO_NBYTES_SHIFT   (0U)
#define TCD_0_TCD6_NBYTES_MLOFFNO_NBYTES_WIDTH   (30U)
#define TCD_0_TCD6_NBYTES_MLOFFNO_NBYTES(x)      (((uint32_t)(((uint32_t)(x)) << TCD_0_TCD6_NBYTES_MLOFFNO_NBYTES_SHIFT)) & TCD_0_TCD6_NBYTES_MLOFFNO_NBYTES_MASK)

#define TCD_0_TCD6_NBYTES_MLOFFNO_DMLOE_MASK     (0x40000000U)
#define TCD_0_TCD6_NBYTES_MLOFFNO_DMLOE_SHIFT    (30U)
#define TCD_0_TCD6_NBYTES_MLOFFNO_DMLOE_WIDTH    (1U)
#define TCD_0_TCD6_NBYTES_MLOFFNO_DMLOE(x)       (((uint32_t)(((uint32_t)(x)) << TCD_0_TCD6_NBYTES_MLOFFNO_DMLOE_SHIFT)) & TCD_0_TCD6_NBYTES_MLOFFNO_DMLOE_MASK)

#define TCD_0_TCD6_NBYTES_MLOFFNO_SMLOE_MASK     (0x80000000U)
#define TCD_0_TCD6_NBYTES_MLOFFNO_SMLOE_SHIFT    (31U)
#define TCD_0_TCD6_NBYTES_MLOFFNO_SMLOE_WIDTH    (1U)
#define TCD_0_TCD6_NBYTES_MLOFFNO_SMLOE(x)       (((uint32_t)(((uint32_t)(x)) << TCD_0_TCD6_NBYTES_MLOFFNO_SMLOE_SHIFT)) & TCD_0_TCD6_NBYTES_MLOFFNO_SMLOE_MASK)
/*! @} */

/*! @name TCD6_NBYTES_MLOFFYES - TCD Transfer Size with Minor Loop Offsets */
/*! @{ */

#define TCD_0_TCD6_NBYTES_MLOFFYES_NBYTES_MASK   (0x3FFU)
#define TCD_0_TCD6_NBYTES_MLOFFYES_NBYTES_SHIFT  (0U)
#define TCD_0_TCD6_NBYTES_MLOFFYES_NBYTES_WIDTH  (10U)
#define TCD_0_TCD6_NBYTES_MLOFFYES_NBYTES(x)     (((uint32_t)(((uint32_t)(x)) << TCD_0_TCD6_NBYTES_MLOFFYES_NBYTES_SHIFT)) & TCD_0_TCD6_NBYTES_MLOFFYES_NBYTES_MASK)

#define TCD_0_TCD6_NBYTES_MLOFFYES_MLOFF_MASK    (0x3FFFFC00U)
#define TCD_0_TCD6_NBYTES_MLOFFYES_MLOFF_SHIFT   (10U)
#define TCD_0_TCD6_NBYTES_MLOFFYES_MLOFF_WIDTH   (20U)
#define TCD_0_TCD6_NBYTES_MLOFFYES_MLOFF(x)      (((uint32_t)(((uint32_t)(x)) << TCD_0_TCD6_NBYTES_MLOFFYES_MLOFF_SHIFT)) & TCD_0_TCD6_NBYTES_MLOFFYES_MLOFF_MASK)

#define TCD_0_TCD6_NBYTES_MLOFFYES_DMLOE_MASK    (0x40000000U)
#define TCD_0_TCD6_NBYTES_MLOFFYES_DMLOE_SHIFT   (30U)
#define TCD_0_TCD6_NBYTES_MLOFFYES_DMLOE_WIDTH   (1U)
#define TCD_0_TCD6_NBYTES_MLOFFYES_DMLOE(x)      (((uint32_t)(((uint32_t)(x)) << TCD_0_TCD6_NBYTES_MLOFFYES_DMLOE_SHIFT)) & TCD_0_TCD6_NBYTES_MLOFFYES_DMLOE_MASK)

#define TCD_0_TCD6_NBYTES_MLOFFYES_SMLOE_MASK    (0x80000000U)
#define TCD_0_TCD6_NBYTES_MLOFFYES_SMLOE_SHIFT   (31U)
#define TCD_0_TCD6_NBYTES_MLOFFYES_SMLOE_WIDTH   (1U)
#define TCD_0_TCD6_NBYTES_MLOFFYES_SMLOE(x)      (((uint32_t)(((uint32_t)(x)) << TCD_0_TCD6_NBYTES_MLOFFYES_SMLOE_SHIFT)) & TCD_0_TCD6_NBYTES_MLOFFYES_SMLOE_MASK)
/*! @} */

/*! @name TCD6_SLAST_SDA - TCD Last Source Address Adjustment / Store DADDR Address */
/*! @{ */

#define TCD_0_TCD6_SLAST_SDA_SLAST_SDA_MASK      (0xFFFFFFFFU)
#define TCD_0_TCD6_SLAST_SDA_SLAST_SDA_SHIFT     (0U)
#define TCD_0_TCD6_SLAST_SDA_SLAST_SDA_WIDTH     (32U)
#define TCD_0_TCD6_SLAST_SDA_SLAST_SDA(x)        (((uint32_t)(((uint32_t)(x)) << TCD_0_TCD6_SLAST_SDA_SLAST_SDA_SHIFT)) & TCD_0_TCD6_SLAST_SDA_SLAST_SDA_MASK)
/*! @} */

/*! @name TCD6_DADDR - TCD Destination Address */
/*! @{ */

