rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K39_TCD_0.h
/*! @name CH8_CSR - Channel Control and Status */
/*! @{ */

#define TCD_0_CH8_CSR_ERQ_MASK                   (0x1U)
#define TCD_0_CH8_CSR_ERQ_SHIFT                  (0U)
#define TCD_0_CH8_CSR_ERQ_WIDTH                  (1U)
#define TCD_0_CH8_CSR_ERQ(x)                     (((uint32_t)(((uint32_t)(x)) << TCD_0_CH8_CSR_ERQ_SHIFT)) & TCD_0_CH8_CSR_ERQ_MASK)

#define TCD_0_CH8_CSR_EARQ_MASK                  (0x2U)
#define TCD_0_CH8_CSR_EARQ_SHIFT                 (1U)
#define TCD_0_CH8_CSR_EARQ_WIDTH                 (1U)
#define TCD_0_CH8_CSR_EARQ(x)                    (((uint32_t)(((uint32_t)(x)) << TCD_0_CH8_CSR_EARQ_SHIFT)) & TCD_0_CH8_CSR_EARQ_MASK)

#define TCD_0_CH8_CSR_EEI_MASK                   (0x4U)
#define TCD_0_CH8_CSR_EEI_SHIFT                  (2U)
#define TCD_0_CH8_CSR_EEI_WIDTH                  (1U)
#define TCD_0_CH8_CSR_EEI(x)                     (((uint32_t)(((uint32_t)(x)) << TCD_0_CH8_CSR_EEI_SHIFT)) & TCD_0_CH8_CSR_EEI_MASK)

#define TCD_0_CH8_CSR_EBW_MASK                   (0x8U)
#define TCD_0_CH8_CSR_EBW_SHIFT                  (3U)
#define TCD_0_CH8_CSR_EBW_WIDTH                  (1U)
#define TCD_0_CH8_CSR_EBW(x)                     (((uint32_t)(((uint32_t)(x)) << TCD_0_CH8_CSR_EBW_SHIFT)) & TCD_0_CH8_CSR_EBW_MASK)

#define TCD_0_CH8_CSR_DONE_MASK                  (0x40000000U)
#define TCD_0_CH8_CSR_DONE_SHIFT                 (30U)
#define TCD_0_CH8_CSR_DONE_WIDTH                 (1U)
#define TCD_0_CH8_CSR_DONE(x)                    (((uint32_t)(((uint32_t)(x)) << TCD_0_CH8_CSR_DONE_SHIFT)) & TCD_0_CH8_CSR_DONE_MASK)

#define TCD_0_CH8_CSR_ACTIVE_MASK                (0x80000000U)
#define TCD_0_CH8_CSR_ACTIVE_SHIFT               (31U)
#define TCD_0_CH8_CSR_ACTIVE_WIDTH               (1U)
#define TCD_0_CH8_CSR_ACTIVE(x)                  (((uint32_t)(((uint32_t)(x)) << TCD_0_CH8_CSR_ACTIVE_SHIFT)) & TCD_0_CH8_CSR_ACTIVE_MASK)
/*! @} */

/*! @name CH8_ES - Channel Error Status */
/*! @{ */

#define TCD_0_CH8_ES_DBE_MASK                    (0x1U)
#define TCD_0_CH8_ES_DBE_SHIFT                   (0U)
#define TCD_0_CH8_ES_DBE_WIDTH                   (1U)
#define TCD_0_CH8_ES_DBE(x)                      (((uint32_t)(((uint32_t)(x)) << TCD_0_CH8_ES_DBE_SHIFT)) & TCD_0_CH8_ES_DBE_MASK)

#define TCD_0_CH8_ES_SBE_MASK                    (0x2U)
#define TCD_0_CH8_ES_SBE_SHIFT                   (1U)
#define TCD_0_CH8_ES_SBE_WIDTH                   (1U)
#define TCD_0_CH8_ES_SBE(x)                      (((uint32_t)(((uint32_t)(x)) << TCD_0_CH8_ES_SBE_SHIFT)) & TCD_0_CH8_ES_SBE_MASK)

#define TCD_0_CH8_ES_SGE_MASK                    (0x4U)
#define TCD_0_CH8_ES_SGE_SHIFT                   (2U)
#define TCD_0_CH8_ES_SGE_WIDTH                   (1U)
#define TCD_0_CH8_ES_SGE(x)                      (((uint32_t)(((uint32_t)(x)) << TCD_0_CH8_ES_SGE_SHIFT)) & TCD_0_CH8_ES_SGE_MASK)

#define TCD_0_CH8_ES_NCE_MASK                    (0x8U)
#define TCD_0_CH8_ES_NCE_SHIFT                   (3U)
#define TCD_0_CH8_ES_NCE_WIDTH                   (1U)
#define TCD_0_CH8_ES_NCE(x)                      (((uint32_t)(((uint32_t)(x)) << TCD_0_CH8_ES_NCE_SHIFT)) & TCD_0_CH8_ES_NCE_MASK)

#define TCD_0_CH8_ES_DOE_MASK                    (0x10U)
#define TCD_0_CH8_ES_DOE_SHIFT                   (4U)
#define TCD_0_CH8_ES_DOE_WIDTH                   (1U)
#define TCD_0_CH8_ES_DOE(x)                      (((uint32_t)(((uint32_t)(x)) << TCD_0_CH8_ES_DOE_SHIFT)) & TCD_0_CH8_ES_DOE_MASK)

#define TCD_0_CH8_ES_DAE_MASK                    (0x20U)
#define TCD_0_CH8_ES_DAE_SHIFT                   (5U)
#define TCD_0_CH8_ES_DAE_WIDTH                   (1U)
#define TCD_0_CH8_ES_DAE(x)                      (((uint32_t)(((uint32_t)(x)) << TCD_0_CH8_ES_DAE_SHIFT)) & TCD_0_CH8_ES_DAE_MASK)

#define TCD_0_CH8_ES_SOE_MASK                    (0x40U)
#define TCD_0_CH8_ES_SOE_SHIFT                   (6U)
#define TCD_0_CH8_ES_SOE_WIDTH                   (1U)
#define TCD_0_CH8_ES_SOE(x)                      (((uint32_t)(((uint32_t)(x)) << TCD_0_CH8_ES_SOE_SHIFT)) & TCD_0_CH8_ES_SOE_MASK)

#define TCD_0_CH8_ES_SAE_MASK                    (0x80U)
#define TCD_0_CH8_ES_SAE_SHIFT                   (7U)
#define TCD_0_CH8_ES_SAE_WIDTH                   (1U)
#define TCD_0_CH8_ES_SAE(x)                      (((uint32_t)(((uint32_t)(x)) << TCD_0_CH8_ES_SAE_SHIFT)) & TCD_0_CH8_ES_SAE_MASK)

#define TCD_0_CH8_ES_ERR_MASK                    (0x80000000U)
#define TCD_0_CH8_ES_ERR_SHIFT                   (31U)
#define TCD_0_CH8_ES_ERR_WIDTH                   (1U)
#define TCD_0_CH8_ES_ERR(x)                      (((uint32_t)(((uint32_t)(x)) << TCD_0_CH8_ES_ERR_SHIFT)) & TCD_0_CH8_ES_ERR_MASK)
/*! @} */

/*! @name CH8_INT - Channel Interrupt Status */
/*! @{ */

#define TCD_0_CH8_INT_INT_MASK                   (0x1U)
#define TCD_0_CH8_INT_INT_SHIFT                  (0U)
#define TCD_0_CH8_INT_INT_WIDTH                  (1U)
#define TCD_0_CH8_INT_INT(x)                     (((uint32_t)(((uint32_t)(x)) << TCD_0_CH8_INT_INT_SHIFT)) & TCD_0_CH8_INT_INT_MASK)
/*! @} */

/*! @name CH8_SBR - Channel System Bus */
/*! @{ */

#define TCD_0_CH8_SBR_MID_MASK                   (0xFU)
#define TCD_0_CH8_SBR_MID_SHIFT                  (0U)
#define TCD_0_CH8_SBR_MID_WIDTH                  (4U)
#define TCD_0_CH8_SBR_MID(x)                     (((uint32_t)(((uint32_t)(x)) << TCD_0_CH8_SBR_MID_SHIFT)) & TCD_0_CH8_SBR_MID_MASK)

#define TCD_0_CH8_SBR_PAL_MASK                   (0x8000U)
#define TCD_0_CH8_SBR_PAL_SHIFT                  (15U)
#define TCD_0_CH8_SBR_PAL_WIDTH                  (1U)
#define TCD_0_CH8_SBR_PAL(x)                     (((uint32_t)(((uint32_t)(x)) << TCD_0_CH8_SBR_PAL_SHIFT)) & TCD_0_CH8_SBR_PAL_MASK)

#define TCD_0_CH8_SBR_EMI_MASK                   (0x10000U)
#define TCD_0_CH8_SBR_EMI_SHIFT                  (16U)
#define TCD_0_CH8_SBR_EMI_WIDTH                  (1U)
#define TCD_0_CH8_SBR_EMI(x)                     (((uint32_t)(((uint32_t)(x)) << TCD_0_CH8_SBR_EMI_SHIFT)) & TCD_0_CH8_SBR_EMI_MASK)

#define TCD_0_CH8_SBR_ATTR_MASK                  (0xE0000U)
#define TCD_0_CH8_SBR_ATTR_SHIFT                 (17U)
#define TCD_0_CH8_SBR_ATTR_WIDTH                 (3U)
#define TCD_0_CH8_SBR_ATTR(x)                    (((uint32_t)(((uint32_t)(x)) << TCD_0_CH8_SBR_ATTR_SHIFT)) & TCD_0_CH8_SBR_ATTR_MASK)
/*! @} */

/*! @name CH8_PRI - Channel Priority */
/*! @{ */

